IDEA StatiCa Open Model
LineSupport.EdgePositionType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 edge position type
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public EdgeOrientationType EdgePositionType { get; set; }
Public Property EdgePositionType As EdgeOrientationType
	Get
	Set
public:
property EdgeOrientationType EdgePositionType {
	EdgeOrientationType get ();
	void set (EdgeOrientationType value);
}
Property Value
Type: EdgeOrientationType
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace